Autodesk.Revit.DB.ForgeDM.CloudFolder.GetModels
Gets all Revit Cloud Models that are available to current login user from this Folder.
Returns:
The list of Revit Cloud Models.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be any reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud folder.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.GetFolders
Gets all folders that are available to current login user from this Folder.
Returns:
The list of Folders.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be any reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud folder.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.GetHub
Gets ForgeDM Hub of this Folder.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.GetProject
Gets ForgeDM Project of this Folder.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.Name
Name of this Folder.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.Id
Identifier of this Folder.
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.#ctor(Autodesk.Revit.DB.ForgeDM.CloudProject,System.String,System.String)
Constructor for CloudFolder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.#ctor(System.String,System.String)
Constructor for CloudFolder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder.#ctor(Autodesk.Revit.DB.ForgeDM.CloudFolder)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ForgeDM.CloudFolder
This class represents a Folder from ForgeDM (Data Management, see https://developer.autodesk.com/en/docs/data/v2/overview/).
Since:
2022